In [5]:
import pandas as pd 
from glob import glob

In [6]:
names = pd.read_csv('world-country-names.csv')
data = pd.read_csv('world-country-named.csv')

In [7]:
names.head()

   id         name
0   4  Afghanistan
1   8      Albania
2  12      Algeria
3  24       Angola
4  10   Antarctica

In [9]:
data.head()

,Unnamed: 0,name,Happiness_score,pf_rol,pf_ss,pf_movement,pf_religion,pf_association,pf_expression,pf_identity,ef_government,ef_legal,ef_money,ef_trade,ef_regulation,id,Country Code,2017,Hours
0,153,Afghanistan,3.203,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,AFG,1.559,NaN
1,106,Albania,4.719,5.3,9.3,10.0,9.2,10,8.6,5.8,7.5,5.1,9.6,8.3,7.8,NaN,ALB,13.750,38.837518
2,87,Algeria,5.211,3.8,7.8,5.8,4.9,5,7.3,0.0,3.6,4.7,7.3,2.8,5.4,NaN,DZA,11.996,41.900000
3,156,Angola,NaN,3.4,8.1,6.7,8.8,4,6.5,5.0,6.8,3.0,5.6,3.2,5.7,NaN,AGO,7.139,NaN
4,46,Argentina,6.086,5.7,8.8,10.0,7.8,7.5,8.7,10.0,5.7,4.0,6.5,6.5,5.6,NaN,ARG,8.347,NaN

In [11]:
df3 = pd.merge(names, data, on="name")
df3.head()

,id_x,name,Unnamed: 0,Happiness_score,pf_rol,pf_ss,pf_movement,pf_religion,pf_association,pf_expression,pf_identity,ef_government,ef_legal,ef_money,ef_trade,ef_regulation,id_y,Country Code,2017,Hours
0,4,Afghanistan,153,3.203,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,AFG,1.559,NaN
1,8,Albania,106,4.719,5.3,9.3,10.0,9.2,10,8.6,5.8,7.5,5.1,9.6,8.3,7.8,NaN,ALB,13.750,38.837518
2,12,Algeria,87,5.211,3.8,7.8,5.8,4.9,5,7.3,0.0,3.6,4.7,7.3,2.8,5.4,NaN,DZA,11.996,41.900000
3,24,Angola,156,NaN,3.4,8.1,6.7,8.8,4,6.5,5.0,6.8,3.0,5.6,3.2,5.7,NaN,AGO,7.139,NaN
4,32,Argentina,46,6.086,5.7,8.8,10.0,7.8,7.5,8.7,10.0,5.7,4.0,6.5,6.5,5.6,NaN,ARG,8.347,NaN

In [18]:
df = df3.loc[:, ['id_x','name', 'Happiness_score','Country Code','2017','Hours']]

In [23]:
df.rename(columns = {'id_x': 'id'})

      id         name  Happiness_score Country Code    2017      Hours
0      4  Afghanistan            3.203          AFG   1.559        NaN
1      8      Albania            4.719          ALB  13.750  38.837518
2     12      Algeria            5.211          DZA  11.996  41.900000
3     24       Angola              NaN          AGO   7.139        NaN
4     32    Argentina            6.086          ARG   8.347        NaN
..   ...          ...              ...          ...     ...        ...
149  862    Venezuela            4.707          NaN     NaN        NaN
150  704      Vietnam            5.175          VNM   1.886        NaN
151  887        Yemen            3.380          NaN     NaN  43.250100
152  894       Zambia            4.107          ZMB   7.206  40.773100
153  716     Zimbabwe            3.663          ZWE   4.943  37.804900

[154 rows x 6 columns]

In [24]:
df.to_csv('reformated.csv', index=False)